ikapoz/stm32/led-blink/src/pie/mcu/stm32f1/boot.h
#pragma once
#include "stm32f1xx_ll_bus.h"
#include "stm32f1xx_ll_cortex.h"
#include "stm32f1xx_ll_dma.h"
#include "stm32f1xx_ll_exti.h"
#include "stm32f1xx_ll_gpio.h"
#include "stm32f1xx_ll_pwr.h"
#include "stm32f1xx_ll_rcc.h"
//#include "stm32f1xx_ll_spi.h"
#include "stm32f1xx_ll_system.h"
#include "stm32f1xx_ll_utils.h"

#if defined(USE_FULL_ASSERT)
#include "Core/Inc/stm32_assert.h"
#endif /* USE_FULL_ASSERT */

#define END_REGION 0xAABBCCDD

#ifndef NVIC_PRIORITYGROUP_0
#define NVIC_PRIORITYGROUP_0                                                   \
  ((uint32_t)0x00000007) /*!< 0 bit  for pre-emption priority,                 \
                              4 bits for subpriority */
#define NVIC_PRIORITYGROUP_1                                                   \
  ((uint32_t)0x00000006) /*!< 1 bit  for pre-emption priority,                 \
                              3 bits for subpriority */
#define NVIC_PRIORITYGROUP_2                                                   \
  ((uint32_t)0x00000005) /*!< 2 bits for pre-emption priority,                 \
                              2 bits for subpriority */
#define NVIC_PRIORITYGROUP_3                                                   \
  ((uint32_t)0x00000004) /*!< 3 bits for pre-emption priority,                 \
                              1 bit  for subpriority */
#define NVIC_PRIORITYGROUP_4                                                   \
  ((uint32_t)0x00000003) /*!< 4 bits for pre-emption priority,                 \
                              0 bit  for subpriority */
#endif

void reset_handler();

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void);

#define DRDY_Pin LL_GPIO_PIN_3
#define DRDY_GPIO_Port GPIOA
#define DRDY_EXTI_IRQn EXTI3_IRQn